[
  {
    "id": 1,
    "question": "Do you require a product that is free to use?",
    "hint": "If you are looking only for free to use or open source schedulers, please select yes. If you are open to using commercial software, please select no.",
    "key": "freeSoftware",
    "type": "boolean"
  },
  {
    "id": 2,
    "question": "Are you limited to using only free or open source software?",
    "hint": "If you are looking only for free to use or open source schedulers, please select yes. If you are open to using commercial software, please select no.",
    "key": "openSourceSoftware",
    "type": "boolean"
  },
  {
    "id": 3,
    "question": "Do you require commercial support?",
    "hint": "Will you require a support contract with the vendor to ensure that you can get help when you need it?",
    "key": "commercialSupport",
    "type": "boolean"
  },
  {
    "id": 4,
    "question": "What is your typical task duration?",
    "hint": "Consider how long a single task or job typically runs in your workflow. Are they short (Seconds to Minutes), medium (Minutes to Hours)? This helps determine the best scheduling strategy for efficiency and resource allocation.",
    "key": "typicalTaskDuration",
    "type": "rankedChoice"
  },
  {
    "id": 5,
    "question": "What is your approximate task submission rate?",
    "hint": "How many tasks will your clients to the scheduler submit at their peak?",
    "key": "taskSubmissionRate",
    "type": "rankedChoice"
  },
  {
    "id": 6,
    "question": "Do you need Microsoft Windows compute nodes?",
    "hint": "Will you require workload to run under Microsoft Windows? The management/ control can be on Linux",
    "key": "microsoftWindowsComputeNodes",
    "type": "boolean"
  },
  {
    "id": 7,
    "question": "Do you need support for containers?",
    "hint": "Is your workload packaged as a container image?",
    "key": "supportForContainers",
    "type": "boolean"
  },
  {
    "id": 8,
    "question": "Do you require support for ARM64 CPU architecture?",
    "hint": "Does your workload and/or the management/ control plane need to run on ARM64/ AARCH64 CPU ISA",
    "key": "arm64CPUSupport",
    "type": "boolean"
  },
  {
    "id": 9,
    "question": "Do you need support for GPUs?",
    "hint": "Do you need the scheduler to place workloads accounting for GPU availability and requirements? This is important for workloads that require GPU acceleration, such as machine learning or high-performance computing tasks.",
    "key": "gpuSupport",
    "type": "boolean"
  },
  {
    "id": 10,
    "question": "Do you require advanced resource scheduling features?",
    "hint": "Will you require the ability to create multiple pools of resources which can be shared between multiple users and reclaimed based on ownership or allocation or timing?",
    "key": "advancedResourceScheduling",
    "type": "boolean"
  },
  {
    "id": 11,
    "question": "Do you need data aware scheduling?",
    "hint": "Is the data that will be used the compute nodes geographically distributed? If so do you require the ability to schedule workloads accounting for data locality?",
    "key": "dataAwareScheduling",
    "type": "boolean"
  },
  {
    "id": 12,
    "question": "Do you need integration with Kubernetes?",
    "hint": "Do you require the scheduler to manage resources within a Kubernetes cluster?",
    "key": "IntegrationK8",
    "type": "boolean"
  },
  {
    "id": 13,
    "question": "Do you require the scheduler to manage cloud resources?",
    "hint": "Will you require the scheduler to automatically create and destroy cloud resources based on the workload for you or will this be handled elsewhere?",
    "key": "managedCloudResources",
    "type": "boolean"
  },
  {
    "id": 14,
    "question": "Do you wish to use spot/ preemptible/ low priority VMs on cloud?",
    "hint": "Will you require your scheduler to use cheaper spot capacity when it is available (at the risk of it being preempted before your workload completes)?",
    "key": "supportCloudSpotCapacity",
    "type": "boolean"
  },
  {
    "id": 15,
    "question": "Do you require attribute based selection for capacity provisioning on cloud?",
    "hint": "Do you require the abilit to select cloud resources based on attributes such as CPU, memory, GPU as opposed to specifying the exact type of VM to use?",
    "key": "advancedCapacityProvisioning",
    "type": "boolean"
  },
    {
    "id": 16,
    "question": "Do you require a fully managed cloud service?",
    "hint": "Do you want the solution to provide a fully managed service that takes care of all the infrastructure and maintenance for you?",
    "key": "managedCloudSolution",
    "type": "boolean"
  },
  {
    "id": 17,
    "question": "Do you require AWS integration?",
    "hint": "Do you require integration with AWS so that the scheduler managed your AWS resources for you?",
    "key": "cloudAWSIntegration",
    "type": "boolean"
  },
  {
    "id": 18,
    "question": "Do you require Azure integration?",
    "hint": "Do you require integration with Microsoft Azure so that the scheduler managed your AWS resources for you?",
    "key": "cloudAzureIntegration",
    "type": "boolean"
  },
  {
    "id": 19,
    "question": "Do you require Google Cloud support",
    "hint": "Do you require integration with Google Cloud so that the scheduler managed your AWS resources for you?",
    "key": "cloudGCPIntegration",
    "type": "boolean"
  },
  {
    "id": 20,
    "question": "Which cloud providers do you require support for?",
    "hint": "",
    "key": "supportedCloudProviders",
    "type": "multiSelect",
    "dependsOn": [
      {
        "key": "cloudGCPIntegration",
        "value": true
      }
    ]
  }
]
